{
  "idioms": {
    "bite the bullet": "To endure a painful experience or situation (दर्दनाक अनुभव या स्थिति को सहन करना).",
    "break the ice": "To initiate a conversation in a social setting (सामाजिक वातावरण में बातचीत शुरू करना).",
    "hit the sack": "To go to bed or sleep (सोने जाना)."
  },
  "phrasal_verbs": {
     "bring up": "To mention a topic in conversation (किसी विषय को बातचीत में लाना).",
    "give up": "To stop trying or surrender (हार मानना या छोड़ देना).",
    "look after": "To take care of someone or something (किसी का ध्यान रखना).",
    "abide by": "To follow or obey a rule, decision, or law (नियम, निर्णय या कानून का पालन करना).",
    "abound in": "To exist in large numbers or quantities (बहुतायत में होना).",
    "abound with": "To be filled with something in great quantity (किसी चीज़ से भरा होना).",
    "accede to": "To agree to a request or demand, often after initial resistance (अक्सर प्रारंभिक विरोध के बाद किसी अनुरोध या मांग से सहमत होना).",
    "accord with": "To be consistent or in agreement with something (किसी चीज़ के साथ संगत या सहमत होना).",
    "account for": "To explain or justify something (किसी चीज़ की व्याख्या या औचित्य बताना).",
    "add up": "To make sense or seem reasonable (समझ में आना या उचित लगना).",
    "add up to": "To result in a total amount or effect (कुल राशि या प्रभाव में परिणत होना).",
    "adhere to": "To stick firmly to a rule, belief, or surface (किसी नियम, विश्वास, या सतह पर दृढ़ता से बने रहना).",
    "adjourn to": "To move to another place for a meeting or activity (किसी बैठक या गतिविधि के लिए दूसरी जगह जाना).",
    "agree with": "To share the same opinion as someone else or be beneficial to someone’s health (किसी और की राय से सहमत होना या किसी के स्वास्थ्य के लिए लाभकारी होना).",
    "ace out": "To narrowly defeat someone or achieve something successfully (किसी को थोड़ा-सा हराना या सफलतापूर्वक कुछ हासिल करना).",
    "ache for": "To strongly desire or yearn for something (किसी चीज़ की तीव्र इच्छा या लालसा करना).",
    "act out": "To perform or express emotions through actions, sometimes disruptively (क्रियाओं के माध्यम से भावनाओं का प्रदर्शन या व्यक्त करना, कभी-कभी विघटनकारी ढंग से).",
    "act up": "To behave badly or not function properly (खराब व्यवहार करना या सही ढंग से काम नहीं करना).",
    "aim at": "To direct efforts, attention, or a weapon towards something (किसी चीज़ की ओर प्रयास, ध्यान, या हथियार निर्देशित करना).",
    "allow for": "To consider or include something as a possibility (किसी चीज़ को संभावना के रूप में मानना या शामिल करना).",
    "allow of": "To permit or leave room for something (किसी चीज़ की अनुमति देना या जगह छोड़ना).",
    "allude to": "To refer to something indirectly (किसी चीज़ का अप्रत्यक्ष रूप से उल्लेख करना).",
    "amount to": "To equal or add up to a specific total or effect (किसी विशिष्ट कुल राशि या प्रभाव के बराबर होना या जोड़ना)."
    
  },
  "words": {
    "happy": "A feeling of joy, pleasure, or contentment.",
    "fast": "Moving quickly or able to perform at high speed.",
    "strong": "Having great physical power or mental determination.",
    "intelligent": "Having the ability to acquire and apply knowledge and skills.",
    "brave": "Showing courage and willingness to face danger.",
    "accept": "To agree to take or receive something offered (स्वीकार करना).",
    "allow": "To permit something to happen or someone to do something (अनुमति देना).",
    "ask": "To put a question to someone (पूछना).",
    "believe": "To accept that something is true (विश्वास करना).",
    "borrow": "To take and use something belonging to someone else with the intention of returning it (उधार लेना).",
    "bring": "To take or carry someone or something to a place (लाना).",
    "build": "To construct something by putting parts or materials together (निर्माण करना).",
    "buy": "To acquire something in exchange for money (खरीदना).",
    "call": "To communicate with someone by phone or shout to attract their attention (बुलाना).",
    "cancel": "To decide that something already planned will not happen (रद्द करना).",
    "change": "To make or become different (बदलना).",
    "clean": "To remove dirt from something (साफ करना).",
    "come": "To move towards or arrive at a specified place (आना).",
    "complain": "To express dissatisfaction or annoyance about something (शिकायत करना).",
    "cough": "To expel air from the lungs suddenly with a sharp sound (खांसना).",
    "count": "To determine the total number of items in a group (गिनना).",
    "cut": "To divide something into pieces with a sharp tool (काटना).",
    "dance": "To move rhythmically to music (नृत्य करना).",
    "draw": "To produce a picture or diagram by making lines on a surface (चित्र बनाना).",
    "drive": "To operate and control the direction and speed of a motor vehicle (चलाना).",
    "eat": "To put food into the mouth, chew it, and swallow it (खाना).",
    "explain": "To make something clear or easy to understand (समझाना).",
    "fall": "To move downward, typically rapidly and freely without control (गिरना).",
    "fill": "To make something full (भरना).",
    "find": "To discover something unexpectedly or by searching (ढूँढना).",
    "fix": "To repair something that is broken or damaged (ठीक करना).",
    "fly": "To move through the air using wings (उड़ना).",
    "forget": "To fail to remember (भूलना).",
    "give": "To present something voluntarily without expecting anything in return (देना).",
    "go": "To move from one place to another (जाना).",
    "have": "To possess, own, or hold something (होना).",
    "hear": "To perceive sound via the ear (सुनना).",
    "help": "To assist someone in doing something (मदद करना).",
    "hide": "To put something in a place where it cannot be seen or found (छिपाना).",
    "hit": "To strike someone or something with force (मारना).",
    "hold": "To grasp or support something with one's hands (पकड़ना).",
    "hope": "To desire something to happen or be the case (आशा करना).",
    "hug": "To hold someone tightly in one's arms, typically to express affection (गले लगाना).",
    "jump": "To push oneself off a surface and into the air by using the muscles in one's legs and feet (कूदना).",
    "keep": "To have or retain possession of something (रखना).",
    "know": "To be aware of through observation, inquiry, or information (जानना).",
    "laugh": "To make sounds and movements of the face and body that usually express amusement (हंसना).",
    "learn": "To acquire knowledge or skill through study or experience (सीखना).",
    "leave": "To go away from a place (छोड़ना).",
    "lend": "To give something to someone for a short time, expecting it to be returned (उधार देना).",
    "let": "To allow or permit someone to do something (अनुमति देना).",
    "like": "To find something agreeable or enjoyable (पसंद करना).",
    "live": "To remain alive or exist (जीवित रहना).",
    "look": "To direct one's gaze in a specified direction (देखना).",
    "lose": "To be deprived of or cease to have something (खोना).",
    "love": "To feel deep affection for someone (प्रेम करना).",
    "make": "To create or construct something (बनाना).",
    "need": "To require something because it is essential or very important (जरूरत होना).",
    "open": "To move something so that it is no longer closed (खोलना).",
    "organize": "To arrange systematically; order (व्यवस्थित करना).",
    "paint": "To cover a surface with color using a brush (रंग करना).",
    "play": "To engage in an activity for enjoyment and recreation (खेलना).",
    "put": "To move something into a specified position (रखना).",
    "read": "To look at and comprehend the meaning of written or printed matter (पढ़ना).",
    "remember": "To have in or be able to bring to one's mind an awareness of someone or something from the past (याद रखना).",
    "run": "To move at a speed faster than a walk (दौड़ना).",
    "say": "To utter words to convey information or express a feeling (कहना).",
    "see": "To perceive with the eyes (देखना).",
    "sell": "To give something in exchange for money (बेचना).",
    "send": "To cause something to go or be taken to a particular destination (भेजना).",
    "show": "To display or allow to be perceived (दिखाना).",
    "sing": "To produce musical tones with the voice (गाना).",
    "sit": "To rest with the body supported by the buttocks or thighs (बैठना).",
    "sleep": "To rest by closing the eyes and becoming unconscious (सोना).",
    "speak": "To say words in order to express thoughts or feelings (बोलना).",
    "spend": "To use money to pay for something (खर्च करना).",
    "stand": "To be in an upright position on the feet (खड़ा होना).",
    "study": "To devote time and attention to acquiring knowledge (पढ़ाई करना).",
    "swim": "To move through water by moving the body or parts of the body (तैरना).",
    "take": "To acquire possession, control, or occupancy of something (लेना).",
    "talk": "To express thoughts, feelings, or information by speaking (बात करना).",
    "teach": "To impart knowledge or instruct someone (पढ़ाना).",
    "tell": "To communicate information, facts, or news to someone (बताना).",
    "think": "To have a particular opinion, belief, or idea about someone or something (सोचना).",
    "throw": "To propel something with force through the air by a movement of the arm and hand (फेंकना).",
    "touch": "To come into or be in contact with something (छूना).",
    "travel": "To make a journey, typically of some length (यात्रा करना).",
    "try": "To make an attempt or effort to do something (प्रयास करना).",
    "turn": "To move or cause to move in a circular direction around an axis or point (मोड़ना).",
    "use": "To take, hold, or deploy something as a means of accomplishing a purpose (उपयोग करना).",
    "wait": "To stay where one is or delay action until a particular time (इंतजार करना).",
    "wake": "To emerge or cause to emerge from sleep (जागना).",
    "walk": "To move at a regular pace by lifting and setting down each foot in turn (चलना).",
    "want": "To have a desire to possess or do something (चाहना).",
    "watch": "To look at or observe attentively over a period of time (देखना).",
    "wear": "To have clothing, jewelry, etc., on one's body (पहनना).",
    "win": "To be successful or victorious in a contest or conflict (जीतना).",
    "work": "To engage in physical or mental activity in order to achieve a result (काम करना).",
    "worry": "To give way to anxiety or unease; allow one's mind to dwell on difficulty or troubles (चिंता करना)."
  }
}
